Documents/РасходНаРекламу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходНаРекламу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РекламныеРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходНаРекламу/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФорму(ДокументСсылка) Экспорт
	
	Макет = Документы.РасходНаРекламу.ПолучитьМакет("МакетРасхода");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходНаРекламу.Номер КАК Номер,
	|	РасходНаРекламу.Дата КАК Дата,
	|	РасходНаРекламу.Кампания КАК Кампания,
	|	РасходНаРекламу.Кампания.Канал КАК Канал,
	|	РасходНаРекламу.СуммаУпр КАК СуммаУпр
	|ИЗ
	|	Документ.РасходНаРекламу КАК РасходНаРекламу
	|ГДЕ
	|	РасходНаРекламу.Ссылка = &Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Номер = Шапка.Номер;
	Область.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=D");
	Область.Параметры.Кампания = Шапка.Кампания;
	Область.Параметры.Канал = Шапка.Канал;
	Область.Параметры.СуммаУпр = Формат(Шапка.СуммаУпр, "ЧДЦ=2");
	Область.Параметры.Валюта = Константы.УправленческаяВалюта.Получить();
	ТабДок.Вывести(Область);
	ТабДок.Вывести(Макет.ПолучитьОбласть("Подвал"));
	
	Возврат ТабДок;
	
КонецФункции
